app/controllers/candidates_controller.rb

SELECT "candidates".* FROM "candidates"
---
  def index
    @candidates = Candidate.all

SELECT  "candidates".* FROM "candidates" WHERE "candidates"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_candidate
      @candidate = Candidate.find(params[:id])